app/views/raffles/paid.slim

SELECT "raffles".* FROM "raffles" ORDER BY "order" DESC
SELECT COUNT(*) FROM "raffles"
---
  .col
    h1 = Raffle.all.count
.row.border