app/controllers/prices_controller.rb

SELECT "prices".* FROM "prices"
---
  def index
    @prices = Price.all

INSERT INTO "prices" ("name", "rrss", "description", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    price = Price.create!(price_params(params))

SELECT "prices".* FROM "prices" WHERE "prices"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "prices" SET "description" = $1, "updated_at" = $2 WHERE "prices"."id" = $3  [["description", "Perfume de hombre según disponiblidad de la tiendita"], ["updated_at", "2021-03-16 16:52:51.678905"], ["id", 13]]
---
  def update
    Price.find(@price.id).update(price_params(params))

SELECT "prices".* FROM "prices"
---
  def all
    @prices = Price.all

SELECT "prices".* FROM "prices" WHERE "prices"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def set_prices
    @price = Price.find(params[:id])