app/controllers/raffles_controller.rb

  def index
    @raffles = Raffle.all
---
SELECT "raffles".* FROM "raffles"

  def paid
    @raffles = Raffle.all.order(number: :asc)
---
SELECT "raffles".* FROM "raffles" ORDER BY "raffles"."number" DESC

  def create
    url = 'http://www.padpow.com/api/v1/charges'
    # nimrod.avispa.work
    require 'json'
    numbers = JSON.parse(raffle_params(params)[:number])
    code = "rifacamila#{numbers.join("")}"
    numbers.each do |number|
      redirect_to raffles_path unless Raffle.find_by(number: number).nil?
      Raffle.create!(name: raffle_params(params)[:name],
                    phone: raffle_params(params)[:phone],
                    mail: raffle_params(params)[:mail],
                    number: number,
                    code: code)
---
INSERT INTO "raffles" ("name", "phone", "number", "created_at", "updated_at", "code") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "camila bravo"], ["phone", "123"], ["number", 47], ["created_at", "2021-04-30 15:39:15.122861"], ["updated_at", "2021-04-30 15:39:15.122861"], ["code", "47485758"]]

  def response_paid
    raffles = Raffle.where(code: params["id"])
    raffles.each do |raffle|
      raffle.update('paid': 'completed')
---
SELECT "raffles".* FROM "raffles" WHERE "raffles"."code" = $1  [["code", "8896979899100106107108109"]]
UPDATE "raffles" SET "paid" = $1, "updated_at" = $2 WHERE "raffles"."id" = $3  [["paid", "completed"], ["updated_at", "2021-05-01 02:26:18.956356"], ["id", 205]]

  def update
    Raffle.find(@raffle.id).update(raffle_params(params))
---
SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "raffles" SET "name" = $1, "mail" = $2, "updated_at" = $3 WHERE "raffles"."id" = $4  [["name", "Cristian Fuentealba"], ["mail", "cristianfuentealbaa@gmail.com"], ["updated_at", "2021-03-17 00:42:42.701213"], ["id", 20]]

  def destroy
    Raffle.delete(params["id"])
---
DELETE FROM "raffles" WHERE "raffles"."id" = $1  [["id", 13]]

  def set_raffles
    @raffle = Raffle.find(params[:id])
---
SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]