app/controllers/raffles_controller.rb

SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def update
    Raffle.find(@raffle.id).update(raffle_params(params))

SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
  def set_raffles
    @raffle = Raffle.find(params[:id])